---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.StairsRunStyle.Straight
enum: Autodesk.Revit.DB.Architecture.StairsRunStyle
source: html/1dc06f71-259c-1fb1-2fd7-6fa449f628e0.htm
---
# Autodesk.Revit.DB.Architecture.StairsRunStyle.Straight

A straight run is defined by a straight line. All treads are rectangular.